cases/Hecht_Panda_2019/cryogenic_H2_test_01/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Non-reacting H2/air mixture for cryogenic dispersion — Hecht & Panda (2019).
//
// H2  : para-H2 tabulated from CoolProp 'parahydrogen' (Leachman et al. 2009
//        EOS, identical to NIST REFPROP).  Covers 50–350 K at 1 atm.
//        h = 0 at T_ref = 298.15 K.
// air : tabulated from GRI3.0 JANAF low-range coefficients (valid 200–1000 K;
//        extrapolation to 50 K introduces < 2 % error in Cp since air Cp is
//        nearly constant at ~990–1015 J/kg/K over this range).
//        h = 0 at T_ref = 298.15 K (consistent with H2 reference).
// transport : Sutherland for both species (mu = As*T^1.5 / (T + Ts)).
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         multiComponentMixture;
    transport       sutherland;
    thermo          hTabulated;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

species
(
    H2
    air
);

inertSpecie air;

// ─── H2 : para-hydrogen ──────────────────────────────────────────────────────
// Source : CoolProp 'parahydrogen' (Leachman et al. 2009 EOS)
// P      : 101325 Pa (gas-phase, near-ideal throughout range)
// Cp peak ~16 300 J/kg/K near 170 K — quantum rotational excitation of para-H2
H2
{
    specie
    {
        molWeight       2.01588;
    }
    thermodynamics
    {
        Tlow            50;
        Thigh           350;

        values
        (
            // ( T [K]    h [J/kg]        Cp [J/kg/K] )
            (   50.0     -3661430.75    10547.64 )
            (   55.0     -3608570.39    10605.37 )
            (   60.0     -3555282.98    10719.46 )
            (   65.0     -3501274.28    10894.34 )
            (   70.0     -3446236.82    11130.73 )
            (   75.0     -3389870.08    11425.14 )
            (   80.0     -3331900.75    11770.26 )
            (   85.0     -3272099.96    12155.82 )
            (   90.0     -3210295.48    12569.61 )
            (   95.0     -3146378.37    12998.70 )
            (  100.0     -3080304.27    13430.36 )
            (  105.0     -3012090.00    13852.94 )
            (  110.0     -2941806.93    14256.37 )
            (  115.0     -2869571.90    14632.53 )
            (  120.0     -2795537.31    14975.35 )
            (  125.0     -2719880.90    15280.74 )
            (  130.0     -2642796.18    15546.44 )
            (  135.0     -2564483.87    15771.78 )
            (  140.0     -2485144.68    15957.39 )
            (  145.0     -2404973.42    16104.95 )
            (  150.0     -2324154.54    16216.90 )
            (  155.0     -2242858.90    16296.18 )
            (  160.0     -2161241.74    16346.07 )
            (  165.0     -2079441.52    16369.98 )
            (  170.0     -1997579.53    16371.34 )
            (  175.0     -1915760.22    16353.45 )
            (  180.0     -1834071.79    16319.48 )
            (  185.0     -1752587.30    16272.35 )
            (  190.0     -1671365.82    16214.70 )
            (  195.0     -1590453.78    16148.95 )
            (  200.0     -1509886.35    16077.19 )
            (  205.0     -1429688.82    16001.27 )
            (  210.0     -1349877.91    15922.79 )
            (  215.0     -1270462.98    15843.08 )
            (  220.0     -1191447.24    15763.28 )
            (  225.0     -1112828.76    15684.32 )
            (  230.0     -1034601.42    15606.94 )
            (  235.0      -956755.73    15531.74 )
            (  240.0      -879279.56    15459.19 )
            (  245.0      -802158.82    15389.63 )
            (  250.0      -725377.92    15323.29 )
            (  255.0      -648920.30    15260.33 )
            (  260.0      -572768.82    15200.85 )
            (  265.0      -496906.00    15144.86 )
            (  270.0      -421314.39    15092.36 )
            (  275.0      -345976.71    15043.28 )
            (  280.0      -270876.06    14997.53 )
            (  285.0      -195996.01    14955.01 )
            (  290.0      -121320.74    14915.60 )
            (  295.0       -46835.11    14879.14 )
            (  300.0        27475.33    14845.49 )
            (  310.0       175624.60    14786.03 )
            (  320.0       323227.42    14736.00 )
            (  330.0       470372.02    14694.20 )
            (  340.0       617135.10    14659.52 )
            (  350.0       763582.67    14630.93 )
        );
    }
    transport
    {
        // mu(50 K) ≈ 1.66 µPa·s vs NIST 1.72 µPa·s — ~3 % error
        As              6.897e-07;
        Ts              97;
    }
}

// ─── air : dry air ────────────────────────────────────────────────────────────
// Source : GRI3.0 JANAF low-range coefficients integrated numerically.
// Cp is nearly constant (986–1016 J/kg/K) over 50–350 K; tabulation here
// ensures consistency with the hTabulated thermoType used for H2.
air
{
    specie
    {
        molWeight       28.850334;
    }
    thermodynamics
    {
        Tlow            50;
        Thigh           350;

        values
        (
            // ( T [K]    h [J/kg]        Cp [J/kg/K] )
            (   50.0      -247687.49      986.16 )
            (   55.0      -242755.27      986.72 )
            (   60.0      -237820.26      987.28 )
            (   65.0      -232882.51      987.82 )
            (   70.0      -227942.06      988.36 )
            (   75.0      -222998.96      988.88 )
            (   80.0      -218053.25      989.40 )
            (   85.0      -213104.96      989.91 )
            (   90.0      -208154.13      990.42 )
            (   95.0      -203200.81      990.91 )
            (  100.0      -198245.02      991.40 )
            (  105.0      -193286.79      991.89 )
            (  110.0      -188326.15      992.37 )
            (  115.0      -183363.13      992.84 )
            (  120.0      -178397.75      993.31 )
            (  125.0      -173430.03      993.78 )
            (  130.0      -168460.00      994.24 )
            (  135.0      -163487.68      994.69 )
            (  140.0      -158513.07      995.15 )
            (  145.0      -153536.20      995.60 )
            (  150.0      -148557.08      996.05 )
            (  155.0      -143575.72      996.50 )
            (  160.0      -138592.12      996.94 )
            (  165.0      -133606.31      997.39 )
            (  170.0      -128618.27      997.83 )
            (  175.0      -123628.02      998.27 )
            (  180.0      -118635.55      998.71 )
            (  185.0      -113640.88      999.16 )
            (  190.0      -108643.99      999.60 )
            (  195.0      -103644.89     1000.04 )
            (  200.0       -98643.57     1000.49 )
            (  205.0       -93640.02     1000.93 )
            (  210.0       -88634.25     1001.38 )
            (  215.0       -83626.23     1001.83 )
            (  220.0       -78615.95     1002.28 )
            (  225.0       -73603.42     1002.73 )
            (  230.0       -68588.61     1003.19 )
            (  235.0       -63571.50     1003.65 )
            (  240.0       -58552.10     1004.11 )
            (  245.0       -53530.36     1004.58 )
            (  250.0       -48506.28     1005.05 )
            (  255.0       -43479.84     1005.53 )
            (  260.0       -38451.02     1006.00 )
            (  265.0       -33419.79     1006.49 )
            (  270.0       -28386.12     1006.98 )
            (  275.0       -23350.01     1007.47 )
            (  280.0       -18311.41     1007.97 )
            (  285.0       -13270.30     1008.47 )
            (  290.0        -8226.65     1008.98 )
            (  295.0        -3180.44     1009.50 )
            (  300.0         1868.36     1010.02 )
            (  310.0        11973.89     1011.09 )
            (  320.0        22090.20     1012.18 )
            (  330.0        32217.56     1013.30 )
            (  340.0        42356.27     1014.45 )
            (  350.0        52506.64     1015.63 )
        );
    }
    transport
    {
        // Frank White 2006, 190–2000 K; As corrected for OpenFOAM Sutherland model
        As              1.459e-06;
        Ts              111;
    }
}

// ************************************************************************* //
