cases/Hecht_Panda_2019/cryogenic_H2_test_01/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;
    }

    "(U|h|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }

    Phi
    {
        $p;
    }
}

PIMPLE
{
    momentumPredictor       on;
    transonic               yes;
    nOuterCorrectors        1;
    nCorrectors             2;
    nNonOrthogonalCorrectors 1;
}

potentialFlow
{
    nNonOrthogonalCorrectors 5;
}

relaxationFactors
{
    equations
    {
        "(U|k|epsilon).*"       0.5;
        "(H2|air|h).*"          0.7;
    }
}

// ************************************************************************* //
