cases/Hecht_Panda_2019/cryogenic_H2_test_01/system/singleGraph_r40
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2406                                 |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      singleGraph_r40;
}
// Radial profile at z = 40 mm from nozzle exit (H&P measurement plane).

type            sets;
libs            (sampling);

writeControl    writeTime;
interpolationScheme cellPoint;
setFormat       raw;

sets
{
    radial_z40mm
    {
        type    lineUniform;
        axis    x;
        start   (0     0 0.0400);
        end     (0.05  0 0.0400);
        nPoints 200;
    }
}

fields ( T H2 U );

// ************************************************************************* //
